src/cf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФактическомуИспользованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортСырьевыхТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортНесырьевыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОСВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяРаспределением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСДЦ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтавкиНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет ставки НДС, операции, отраженные по которым, подлежат регистрации в книге продаж.
//
// Параметры:
//   ВходящиеПараметры - Структура, Число - параметры для определения ставок.
//    Если передана Структура, то она должна содержать ключи:
//     * ПрименяетсяОсвобождениеОтУплатыНДС - Булево - признак применения освобождения от уплаты
//               НДС по статье 145 НК. 
//     * ПлательщикНДС - Булево - признак применения общей системы налогообложения.
//     * ВерсияПостановленияНДС1137 - Число - см. УчетНДСПереопределяемый.ВерсияПостановленияНДС1137.
//
// Возвращаемое значение:
//   Массив - ставки НДС.
Функция СтавкиПоОперациямОтражаемымВКнигеПродаж(ВходящиеПараметры) Экспорт
	
	Если ТипЗнч(ВходящиеПараметры) = Тип("Число") Тогда
		Параметры = Новый Структура();
		Параметры.Вставить("ПрименяетсяОсвобождениеОтУплатыНДС", Ложь);
		Параметры.Вставить("ПлательщикНДС",                      Истина);
		Параметры.Вставить("ВерсияПостановленияНДС1137",         ВходящиеПараметры);

	ИначеЕсли ТипЗнч(ВходящиеПараметры) = Тип("Структура") Тогда
		Параметры = ВходящиеПараметры;

	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Перечисления.СтавкиНДС.СтавкиПоОперациямОтражаемымВКнигеПродаж(): недопустимый тип параметра %2, ожидается Число или Структура.'"), ТипЗнч(Параметры));
	КонецЕсли;

	МассивСтавок = Новый Массив;
	
	Если Параметры.ПрименяетсяОсвобождениеОтУплатыНДС Тогда
		МассивСтавок.Добавить(Справочники.СтавкиНДС.БезНДС);
	ИначеЕсли Параметры.ПлательщикНДС Тогда
		МассивСтавок.Добавить(Справочники.СтавкиНДС.НДС0);
		МассивСтавок.Добавить(Справочники.СтавкиНДС.НДС12);
		//МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10);
		//МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10_110);
		//МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18);
		//МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18_118);
		Если Параметры.ВерсияПостановленияНДС1137 <= 3 Тогда
			МассивСтавок.Добавить(Справочники.СтавкиНДС.БезНДС);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивСтавок;
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	НалогообложениеНДС = Неопределено;
	Параметры.Свойство("НалогообложениеНДС", НалогообложениеНДС);
	Если (ЗначениеЗаполнено(НалогообложениеНДС)
			И НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
		Или Параметры.Свойство("Номенклатура") Тогда
		
		МассивИсключаемыхЗначений.Добавить(Справочники.СтавкиНДС.НДС0);
		
	КонецЕсли;
	
	Если МассивИсключаемыхЗначений.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОбщегоНазначенияУТВызовСервера.ДоступныеДляВыбораЗначенияПеречисления(
			"СтавкиНДС",
			ДанныеВыбора,
			Параметры,
			МассивИсключаемыхЗначений);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
